<?xml version="1.0" ?>
<net name="20180408-102900" version="11">
	<layers>
		<layer id="0" name="batch_join/fifo_queue" type="Parameter" version="opset1">
			<data shape="1,160,160,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_join/fifo_queue"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="image_batch:0,input:0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>160</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="batch_join/fifo_queue/Transpose([0 3 1 2])/value4230950068" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_join/fifo_queue/Transpose([0 3 1 2])/value4230950068"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="batch_join/fifo_queue/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_join/fifo_queue/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>160</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="32" size="3456"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Conv2d_1a_3x3/weights/read:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="InceptionResnetV1/Conv2d_1a_3x3/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_1a_3x3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_35478" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3488" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_35478"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="InceptionResnetV1/Conv2d_1a_3x3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_1a_3x3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Conv2d_1a_3x3/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="3616" size="36864"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Conv2d_2a_3x3/weights/read:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="InceptionResnetV1/Conv2d_2a_3x3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_2a_3x3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_3548135486" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="40480" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3548135486"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="InceptionResnetV1/Conv2d_2a_3x3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_2a_3x3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Conv2d_2a_3x3/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="40608" size="73728"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Conv2d_2b_3x3/weights/read:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="InceptionResnetV1/Conv2d_2b_3x3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_2b_3x3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="data_add_3548935494" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="114336" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3548935494"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="InceptionResnetV1/Conv2d_2b_3x3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_2b_3x3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Conv2d_2b_3x3/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="InceptionResnetV1/MaxPool_3a_3x3/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/MaxPool_3a_3x3/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>77</dim>
					<dim>77</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/MaxPool_3a_3x3/MaxPool:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="80, 64, 1, 1" offset="114592" size="20480"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Conv2d_3b_1x1/weights/read:0">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="InceptionResnetV1/Conv2d_3b_1x1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_3b_1x1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="data_add_3549735502" type="Const" version="opset1">
			<data element_type="f32" shape="1, 80, 1, 1" offset="135072" size="320"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3549735502"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="InceptionResnetV1/Conv2d_3b_1x1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_3b_1x1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Conv2d_3b_1x1/Relu:0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="192, 80, 3, 3" offset="135392" size="552960"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Conv2d_4a_3x3/weights/read:0">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="InceptionResnetV1/Conv2d_4a_3x3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_4a_3x3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_add_3550535510" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="688352" size="768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3550535510"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="InceptionResnetV1/Conv2d_4a_3x3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_4a_3x3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Conv2d_4a_3x3/Relu:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 192, 3, 3" offset="689120" size="1769472"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Conv2d_4b_3x3/weights/read:0">
					<dim>256</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="InceptionResnetV1/Conv2d_4b_3x3/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_4b_3x3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_3551335518" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="2458592" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3551335518"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="InceptionResnetV1/Conv2d_4b_3x3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Conv2d_4b_3x3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Conv2d_4b_3x3/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 256, 1, 1" offset="2459616" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/weights/read:0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="data_add_3556135566" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="2492384" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3556135566"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 256, 1, 1" offset="2492512" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/weights/read:0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_add_3554535550" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="2525280" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3554535550"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="2525408" size="36864"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/weights/read:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="data_add_3555335558" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="2562272" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3555335558"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 256, 1, 1" offset="2562400" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/weights/read:0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="data_add_3552135526" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="2595168" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3552135526"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="2595296" size="36864"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/weights/read:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_3552935534" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="2632160" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3552935534"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="2632288" size="36864"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/weights/read:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="data_add_3553735542" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="2669152" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3553735542"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond/FusedBatchNorm_1/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond/FusedBatchNorm_1:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond_1/Merge:0,InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/cond_1/Switch_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="InceptionResnetV1/Repeat/block35_1/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/concat"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/concat:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="InceptionResnetV1/Repeat/block35_1/mul/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 96, 1, 1" offset="2669280" size="98304"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/mul/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/weights/read:0">
					<dim>256</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_3556935574" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="2767584" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_3556935574"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/BiasAdd/Add/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/mul:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="InceptionResnetV1/Repeat/block35_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/add:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="InceptionResnetV1/Repeat/block35_1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="InceptionResnetV1/Repeat/block35_1/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>17</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 256, 1, 1" offset="2768608" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/cond/FusedBatchNorm_1/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/weights/read:0">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/Conv2D" type="Convolution" version="opset1">
